# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

my_list = [-10, 2, 11, 3]
s=0
for element in my_list:
  s = s + element

print(s)


#прикольно! мне нравится! только списал :))
