# Дано целое число. Определить, заканчивается ли оно число цифрой 5?
# Формат входных данных: Целое положительно число
# Формат выходных данных: Если число оканчивается цифрой 5, вывести «YES», в противном случае — вывести «NO».

n = int(input("Please input num"))

if n % 10 == 5:
	print ("Yes")
else:
	print ("No")

  
  
#ТУПО СКОПИРОВАНО :))
